#include <stdio.h>
#include <Windows.h>
/*函数功能:系统功能介绍*/
int ability()
{
	char op;                                               //选择是否退出 
    color(2);                                              //绿色
    printf("          \t\t**************************************************************\n\n");
    color(7);                                              //白色
    printf("                      欢迎来到青穹团队的学习以及图书管理系统功能介绍\n\n");
    color(2);                                              //绿色
    printf("          \t\t**************************************************************\n\n");
    color(7);                                              //白色
    printf("\t\t图书应该如何借阅？\n\n");
    color(9);                                              //淡蓝色
    printf("\t\t1.用户可在指定图书库内查看图书信息，挑选心动书籍\n");
    printf("    \t\t  2.进入预定借书界面，输入需要预定的书籍，并且输入借阅时间。\n\n\n");
    color(7);
    printf("\t\t图书馆座位应该如何借阅？\n\n");
    color(9);                                              //淡蓝色
    printf("\t\t1.进入座位号界面挑选心仪座位\n");
    printf("    \t\t  2.进入座位预定界面，点击预定，即预定成功\n\n\n");
    color(7);
    printf("\t\t如何在学习区学习？\n\n");
    color(9);                                              //淡蓝色
    printf("\t\t1.用户进入学习区界面，选择自己需要学习的科目\n");
    printf("    \t\t  2.进入科目后选择刷题模式之后选择您的学业水平（小学 初中 高中 大学）\n");
    printf("        \t\t   3.选择难度等级，输入选择就可以开始做题啦！\n\n\n");
    color(7);
    printf("\t\t如何查看自己的成绩分析？\n\n");
    color(9);                                              //淡蓝色
    printf("\t\t1.选择完科目后，您可以选择开始做题也可以进入成绩分析系统\n\n\n");
    color(7);
    printf("\t\t如何查看题目解析？\n\n");
    color(9);
    printf("\t\t1.每一次做题结束后，系统将会自动询问您是否需要查看解析\n");
    printf("    \t\t  2.选择完毕科目后您可以进入看题模式\n");
    printf("        \t\t   3.您可以查看题目队列选择题目查看题目和解析\n\n\n");
    color(2);                                              //绿色*
    color(7);                                              //白色
    printf("           \t\t       希望您使用愉快！\n\n    \t\t                            开发团队:青穹\n\n");
    color(2);
    printf("*******************************************************************************************\n\n");
    printf("\t\t退出请输入q哦:");    
    scanf_s(" %c",&op);                                      //输入选择 
	if(op=='q'); 
    return 1;
}

